%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 《实战MATLAB之文件与数据接口技术》附加程序
% 作  者：江泽林 刘维
% 出版社：北京航空航天大学出版社
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% 程序 2-16 testplot.m
%保存为testplot.m文件
%生成测试数据
x = -pi:0.1:pi;
y1 = sin(x);
y2 = cos(x);
%绘制sin曲线
h1 = plot(x,y1);
hold on;%在同一窗口重复绘制
h2 = plot(x,y1,'o');%绘制数据点，数据点采用"o"表示
%改变曲线线性，':'表示虚线
%同时改变曲线宽度
h3 = plot(x,y2,':','linewidth',2);
hold off;
xlabel('横坐标(弧度)');%设置横坐标标记
legend([h1 h2 h3],{'sin','sin数据点','cos虚线'});%设置图例
