% 矩阵幂的极限怎么求？ 01.png
12个篮球队A、B、C、D、E、F、G、H、I、J、K、L进行单循环比赛，其比赛结果如下：



请你给各球队排一个合理的名次

a =[ 1     0     1     1     0     0     1     0     1     0     0     0
     0     1     1     1     0     0     0     1     0     1     1     0
     0     0     0     0     1     1     1     0     1     0     0     0
     0     0     0     0     1     0     1     1     0     1     0     0
     0     0     0     0     0     1     0     1     0     0     1     0
     0     0     0     0     0     0     1     0     0     1     1     0
     0     0     0     0     0     0     0     1     1     0     0     0
     0     0     0     0     0     0     0     1     0     1     0     0
     0     0     0     0     0     0     0     0     0     1     0     0
     0     0     0     0     0     0     0     0     0     1     0     0
     0     0     0     0     0     0     0     0     0     0     1     0
     0     0     0     0     0     0     0     0     0     0     0     0];  
    
b=a(:,[end,1:end-1]);  
al=b|tril(~b',-1);  
al=al+eye(12);  
k=['a':'l'];  
%
[s,m]=unique(sum(al*al*al,2));  
k(m(12:-1:1))  
%
[V,D] = eig(al);  
[C,I] = max(abs(D(:)));  
l=zeros(12);  
l(I)=1;  
[s,m]=unique(sum(V*l*inv(V),2));  
k(m(12:-1:1))