%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 《实战MATLAB之文件与数据接口技术》附加程序
% 作  者：江泽林 刘维
% 出版社：北京航空航天大学出版社
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% 程序2-1
% 保存为testscript.m文件
% 生成一个矢量数据，数据范围从-pi至pi，间隔0.01
x = -pi:0.01:pi; %pi在MATLAB中是是常量，代表圆周率
y = sin(x);%生成绘制数据
ynoise = y + (rand(1,length(y))-0.5)*0.2;%加均匀噪声
%绘制曲线数据，x表示横坐标数据，y表示纵坐标数据
%’r.’表示采用红色作为曲线颜色，每个坐标点采用“.”符号表示
plot(x,y,'r.'); 
hold on;%重复绘制不擦除背景
%绘制曲线，x表示横坐标数据，ynoise表示纵坐标数据
%曲线颜色和坐标点均采用默认形式，即蓝色和连续曲线。
plot(x,ynoise);
hold off;
