% Barnsley fern of chaos game 巴恩斯利蕨
% http://en.wikipedia.org/wiki/Barnsley_fern

 


N=111111*3; % 迭代次数

p=[0.008,0.8,0.096,0.096]; % 生成几率向量
p=[0.01,0.85,0.07,0.07]; % 生成几率向量
seq=randsrc(1,N,[1:4;p]);

M=[0,0,0,0.15,0,0.2;...
   0.83,-0.02,0.04,0.83,0,2;...
   0.2,0.22,-0.3,0.3,0,2;...
   -0.14,0.24,0.31,0.27,0,0.5];
M=[0,0,0,0.16,0,0;...
   0.85,-0.04,0.04,0.85,0,1.6;...
   0.2,0.23,-0.26,0.22,0,1.6;...
   -0.15,0.26,0.28,0.24,0,0.44];
A=arrayfun(@(x) cat(1,reshape(M(x,:),2,3),[0 0 1]),1:4,'un',0);

pot=zeros(3,N+1); pot(3)=1;
for k=1:N;
    pot(:,k+1)=A{seq(k)}*pot(:,k);
end

plot(pot(1,:),pot(2,:),'.','markersize',4)
axis image