function [P n]=reflectpoint(l,y_b_c)
% 输入光点位置 l 给出镜面上射向2.6e3的反射点
% 本函数内的参数均来自 ReflectPoint_doubleCondition 脚本
%%
P=[];
n=0;
%% 3维反射
%L1_x=-7800/4997;
L1_z=548590900/398809 - (2112500*67591^(1/2))/398809;
L2_x=-475800/124817;
%L2_z=13691044900/9961099 - (10562500*1689451^(1/2))/9961099;
if l<L1_z && l>=L2_x
    n=n+1;
    xx=(24985*l + 39000)/(l - 2600);
    yy=(3750*l)/(13*(l - 2600));
    zz=sqrt(60*xx-yy*yy);
    P(n,:)=[xx yy zz];
    n=n+1;
    P(n,:)=[xx yy -zz];
end
%% 水平面反射
L1_xy=28621932/2143837;
L2_xy=-662267224104142020984180824391070315638886413951762976373758259299093567512315316454991/...
    426146113227124466585984707698543508030378292758596513590744552020963016347732261470208;
syms y
ccc=(y^2 + 900)^2*(y - 2600)/( y^4 - 1498200*y^2 - 9360000*y + 1350810000);
assume(-36<y<36)
if l>=L1_xy
    n=n+1;
    yy=eval(solve(ccc==l,'real',true));
    zz=0;
    xx=yy.^2/60;
    P(n,:)=[xx yy -zz];
end
if l<=L2_xy
    n=n+1;
    yy=eval(solve(ccc==l,'real',true));
    zz=[0;0];
    xx=yy.^2/60;
    P(n:n+1,:)=[xx yy -zz];
    n=n+1;
end